zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K342_DMA_TCD.h
/*! @name TCD21_SADDR - TCD Source Address */
/*! @{ */

#define DMA_TCD_TCD21_SADDR_SADDR_MASK           (0xFFFFFFFFU)
#define DMA_TCD_TCD21_SADDR_SADDR_SHIFT          (0U)
#define DMA_TCD_TCD21_SADDR_SADDR_WIDTH          (32U)
#define DMA_TCD_TCD21_SADDR_SADDR(x)             (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD21_SADDR_SADDR_SHIFT)) & DMA_TCD_TCD21_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD21_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define DMA_TCD_TCD21_SOFF_SOFF_MASK             (0xFFFFU)
#define DMA_TCD_TCD21_SOFF_SOFF_SHIFT            (0U)
#define DMA_TCD_TCD21_SOFF_SOFF_WIDTH            (16U)
#define DMA_TCD_TCD21_SOFF_SOFF(x)               (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD21_SOFF_SOFF_SHIFT)) & DMA_TCD_TCD21_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD21_ATTR - TCD Transfer Attributes */
/*! @{ */

#define DMA_TCD_TCD21_ATTR_DSIZE_MASK            (0x7U)
#define DMA_TCD_TCD21_ATTR_DSIZE_SHIFT           (0U)
#define DMA_TCD_TCD21_ATTR_DSIZE_WIDTH           (3U)
#define DMA_TCD_TCD21_ATTR_DSIZE(x)              (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD21_ATTR_DSIZE_SHIFT)) & DMA_TCD_TCD21_ATTR_DSIZE_MASK)

#define DMA_TCD_TCD21_ATTR_DMOD_MASK             (0xF8U)
#define DMA_TCD_TCD21_ATTR_DMOD_SHIFT            (3U)
#define DMA_TCD_TCD21_ATTR_DMOD_WIDTH            (5U)
#define DMA_TCD_TCD21_ATTR_DMOD(x)               (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD21_ATTR_DMOD_SHIFT)) & DMA_TCD_TCD21_ATTR_DMOD_MASK)

#define DMA_TCD_TCD21_ATTR_SSIZE_MASK            (0x700U)
#define DMA_TCD_TCD21_ATTR_SSIZE_SHIFT           (8U)
#define DMA_TCD_TCD21_ATTR_SSIZE_WIDTH           (3U)
#define DMA_TCD_TCD21_ATTR_SSIZE(x)              (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD21_ATTR_SSIZE_SHIFT)) & DMA_TCD_TCD21_ATTR_SSIZE_MASK)

#define DMA_TCD_TCD21_ATTR_SMOD_MASK             (0xF800U)
#define DMA_TCD_TCD21_ATTR_SMOD_SHIFT            (11U)
#define DMA_TCD_TCD21_ATTR_SMOD_WIDTH            (5U)
#define DMA_TCD_TCD21_ATTR_SMOD(x)               (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD21_ATTR_SMOD_SHIFT)) & DMA_TCD_TCD21_ATTR_SMOD_MASK)
/*! @} */

/*! @name TCD21_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define DMA_TCD_TCD21_NBYTES_MLOFFNO_NBYTES_MASK (0x3FFFFFFFU)
#define DMA_TCD_TCD21_NBYTES_MLOFFNO_NBYTES_SHIFT (0U)
#define DMA_TCD_TCD21_NBYTES_MLOFFNO_NBYTES_WIDTH (30U)
#define DMA_TCD_TCD21_NBYTES_MLOFFNO_NBYTES(x)   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD21_NBYTES_MLOFFNO_NBYTES_SHIFT)) & DMA_TCD_TCD21_NBYTES_MLOFFNO_NBYTES_MASK)

#define DMA_TCD_TCD21_NBYTES_MLOFFNO_DMLOE_MASK  (0x40000000U)
#define DMA_TCD_TCD21_NBYTES_MLOFFNO_DMLOE_SHIFT (30U)
#define DMA_TCD_TCD21_NBYTES_MLOFFNO_DMLOE_WIDTH (1U)
#define DMA_TCD_TCD21_NBYTES_MLOFFNO_DMLOE(x)    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD21_NBYTES_MLOFFNO_DMLOE_SHIFT)) & DMA_TCD_TCD21_NBYTES_MLOFFNO_DMLOE_MASK)

#define DMA_TCD_TCD21_NBYTES_MLOFFNO_SMLOE_MASK  (0x80000000U)
#define DMA_TCD_TCD21_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define DMA_TCD_TCD21_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define DMA_TCD_TCD21_NBYTES_MLOFFNO_SMLOE(x)    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD21_NBYTES_MLOFFNO_SMLOE_SHIFT)) & DMA_TCD_TCD21_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD21_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define DMA_TCD_TCD21_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define DMA_TCD_TCD21_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define DMA_TCD_TCD21_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define DMA_TCD_TCD21_NBYTES_MLOFFYES_NBYTES(x)  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD21_NBYTES_MLOFFYES_NBYTES_SHIFT)) & DMA_TCD_TCD21_NBYTES_MLOFFYES_NBYTES_MASK)

#define DMA_TCD_TCD21_NBYTES_MLOFFYES_MLOFF_MASK (0x3FFFFC00U)
#define DMA_TCD_TCD21_NBYTES_MLOFFYES_MLOFF_SHIFT (10U)
#define DMA_TCD_TCD21_NBYTES_MLOFFYES_MLOFF_WIDTH (20U)
#define DMA_TCD_TCD21_NBYTES_MLOFFYES_MLOFF(x)   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD21_NBYTES_MLOFFYES_MLOFF_SHIFT)) & DMA_TCD_TCD21_NBYTES_MLOFFYES_MLOFF_MASK)

#define DMA_TCD_TCD21_NBYTES_MLOFFYES_DMLOE_MASK (0x40000000U)
#define DMA_TCD_TCD21_NBYTES_MLOFFYES_DMLOE_SHIFT (30U)
#define DMA_TCD_TCD21_NBYTES_MLOFFYES_DMLOE_WIDTH (1U)
#define DMA_TCD_TCD21_NBYTES_MLOFFYES_DMLOE(x)   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD21_NBYTES_MLOFFYES_DMLOE_SHIFT)) & DMA_TCD_TCD21_NBYTES_MLOFFYES_DMLOE_MASK)

#define DMA_TCD_TCD21_NBYTES_MLOFFYES_SMLOE_MASK (0x80000000U)
#define DMA_TCD_TCD21_NBYTES_MLOFFYES_SMLOE_SHIFT (31U)
#define DMA_TCD_TCD21_NBYTES_MLOFFYES_SMLOE_WIDTH (1U)
#define DMA_TCD_TCD21_NBYTES_MLOFFYES_SMLOE(x)   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD21_NBYTES_MLOFFYES_SMLOE_SHIFT)) & DMA_TCD_TCD21_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/*! @name TCD21_SLAST_SDA - TCD Last Source Address Adjustment / Store DADDR Address */
/*! @{ */

#define DMA_TCD_TCD21_SLAST_SDA_SLAST_SDA_MASK   (0xFFFFFFFFU)
#define DMA_TCD_TCD21_SLAST_SDA_SLAST_SDA_SHIFT  (0U)
#define DMA_TCD_TCD21_SLAST_SDA_SLAST_SDA_WIDTH  (32U)
#define DMA_TCD_TCD21_SLAST_SDA_SLAST_SDA(x)     (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD21_SLAST_SDA_SLAST_SDA_SHIFT)) & DMA_TCD_TCD21_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD21_DADDR - TCD Destination Address */
/*! @{ */

#define DMA_TCD_TCD21_DADDR_DADDR_MASK           (0xFFFFFFFFU)
#define DMA_TCD_TCD21_DADDR_DADDR_SHIFT          (0U)
#define DMA_TCD_TCD21_DADDR_DADDR_WIDTH          (32U)
#define DMA_TCD_TCD21_DADDR_DADDR(x)             (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD21_DADDR_DADDR_SHIFT)) & DMA_TCD_TCD21_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD21_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define DMA_TCD_TCD21_DOFF_DOFF_MASK             (0xFFFFU)
#define DMA_TCD_TCD21_DOFF_DOFF_SHIFT            (0U)
#define DMA_TCD_TCD21_DOFF_DOFF_WIDTH            (16U)
#define DMA_TCD_TCD21_DOFF_DOFF(x)               (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD21_DOFF_DOFF_SHIFT)) & DMA_TCD_TCD21_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD21_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

